Catalogs/ДМ_ГруппыОтветственных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>ДМ_ГруппыОтветственных</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Пользователи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Физлицо</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭлПочта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ДМ_ГруппыОтветственных/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПолучателиФизлицоПриИзменении(Элемент)
	ТекДанные = Элементы.Получатели.ТекущиеДанные;
	ТекДанные.ЭлПочта = ПолучитьЭлПочту(ТекДанные.Физлицо);
КонецПроцедуры

&НаСервере
Функция ПолучитьЭлПочту( пЧеловек )
	
	Если НЕ ЗначениеЗаполнено(пЧеловек) Тогда
		Возврат "";
	КонецЕсли;
	
	Если ТипЗнч(пЧеловек) = Тип("СправочникСсылка.Пользователи") Тогда
		
		лАдрес = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта( пЧеловек, Справочники.ВидыКонтактнойИнформации.EmailПользователя );
		Возврат лАдрес;
		
	Иначе
		
		Возврат пЧеловек;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Для каждого лСтрокаТЧ Из Объект.Пользователи Цикл
	
		лАдрес = лСтрокаТЧ.ЭлПочта;
		Если ЗначениеЗаполнено(лАдрес)Тогда
			
			Если СтрЧислоВхождений( лАдрес, "@" ) <> 1
				Или Найти( лАдрес, " " ) > 0
				Тогда
				
				лНомерСтроки = Формат( лСтрокаТЧ.НомерСтроки, "ЧГ=" );
				лИндексСтроки = Формат( Объект.Пользователи.Индекс(лСтрокаТЧ), "ЧГ=" );
				лТекстСообщения = НСтр("ru = 'Неправильное значение e-mail в строке №'; en = 'Incorrect e-mail in the line #'") + лНомерСтроки;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю( лТекстСообщения, Объект.Ссылка, "Пользователи["+лИндексСтроки+"].ЭлПочта", "Объект", Отказ );
				
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры
